{"inkVersion":20,"root":[["^Once upon a time...","\n","^This is the tale of Lord Viscount Destin Esquire, The Dapper Cadaver. What is a Dapper Cadaver? How should I know? He spends his days sitting in his fancy mansion. The Lord Viscount walks around with his fancy robes and lack of flesh. Because Destin is also a skeleton.","\n","^Are you ready to listen to his grand adventure?","\n","ev","str","^Yes","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^No","/str","/ev",{"*":"0.c-1","flg":20},{"c-0":["^ Yes","\n",{"->":"Yes"},{"->":"0.g-0"},{"#f":5}],"c-1":["^ No","\n",{"->":"No"},{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"No":["^Screw you!","\n","^Why are you even playing this game? A filthy commoner like you doesn’t deserve Lord Destin’s greatness. It took many bards to craft his legendary tale. Shame on you. This is the most important story in the entire world. And yet you scoff at it as you know better.","\n","^Have fun with your life. You don’t know what you’re missing out on.","\n","end",{"#f":1}],"Yes":[["^Lord Destin lived in a magnificent mansion, one so grandiose that it made other mansions weep tears of insecurity. As opulent as his abode in the woodlands was, Destin lived alone. While this isolation granted Destin a wonderful amount of space between him and detestible humans that oh-so-hated skeletons such as himself, he always wondered what it would be like to live life","\n","^Destin sighed and took a puff of his pipe, simultaneously cursing and praising the cruel yet generous fate that had befallen and blessed him.","\n","^A familiar memory flashed within his bones. A rumor along the howling winds long ago of a place where skeletons went to unwind danced behind his eye sockets. A place where skeletons could get drinks. A place where skeletons could hook up!","\n","^Desire swept Destin off his feet, a gnawing, ravenous yearning within him overtaking him in the process.","\n","^A yearning... for the Arms and Legs Tavern.","\n","^Before he knew it, Destin had his oh-so-stupendous stroll-wear on. As he stared into his reflection and watched it gaze flawlessly back into him, he started towards the exit, prepared to start his long, arduous journey.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":"FirstChoice"},{"#f":5}]}],{"#f":1}],"FirstChoice":[["^But which exit would he take?","\n","ev","str","^Front Door","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Jump Out Window","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Go Through Back Door","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ Go through the front door.","\n",{"->":"FrontDoor"},{"#f":5}],"c-1":["^ Jump out the window.","\n",{"->":"JumpOutWindow"},{"#f":5}],"c-2":["\n","^Go from the back door.","\n",{"->":"BackDoor"},{"#f":5}]}],{"#f":1}],"FrontDoor":["^Destin exited through the front door. Why choose any other option? That would involve thinking. Remember best choices are made with no thought. Destin walked outside with no worries. Why should he be worried? He was Lord Viscount Destin Esquire, The Dapper Cadaver? All he had to do was enter the Arm and Leg Tavern. Then, he could be a living man once again. What could go wrong?","\n","^Hint: It’s God spelled backward. That’s right, the answer is -","\n",{"->":"Dog"},{"#f":1}],"Dog":["^Dog. Or to be more specific, Dogs.","\n","^A pack of dogs stood in front of Destin. He paused. Skeletons and dogs were natural enemies. It’s the natural order. Saliva poured down the beast’s mouth. Their teeth were sharp enough to crack a rib in half. How could humans tame them as pets? Everyone knew him as Lord Viscount Destin Esquire, The Dapper Cadaver. The dogs saw him as a walking meal. Even the puppies were a threat to the mightiest of skeletons.","\n","^And now they were staring straight at him.","\n","^Destin ran from the canine carnivores. That did little for him. He was a skeleton. The dogs tackled him down and pinned the poor skeleton. Destin screamed as the little doggies’ bite through his body. His bones were scattered all over the ground. The dogs feasted on his body like there was no tomorrow. And there was no tomorrow, for Destin. The once-mighty Lord Viscount was reduced to dust and bones.","\n","^At least he was delicious.","\n","^THE END!","\n","end",{"#f":1}],"JumpOutWindow":["^Destin looked at all his options. The front door was too obvious. Only an idiot would barge right through without a plan. Destin thought up alternate travel routes. He searched all over until he found a window.","\n","^“That’s it, the window,” said Destin. “No one will find me there,”","\n","^Destin jumped outside the window like a madman. The crash caught the attention of many animals. Glass rained down like solid water drops. Destin’s skeletal body ignored the class cuts. But he forgot one thing.","\n","^Gravity.","\n","^The force of gravity broke Destin to pieces. It splattered his bones all over the ground. Destin shouted as he searched for his body. How could he be so stupid? Even a skeleton-like him couldn’t defy the magic of gravity. The crashing sound caught the attention of many animals. How could things get any worse?","\n","^Hint: It starts with a d and ends with a g.","\n",{"->":"Dog"},{"#f":1}],"BackDoor":["^The front door was to","\n","^Who knew what dangers lurked just outside his mansion. Window jumping wasn't an option either. True, a skeleton like him wouldn’t worry about","\n","^But the noise could still attract some dangerous foes.","\n","^Go outside the back","\n","^\"I should of kept a backup plan,\" said Destin. \"How silly of me, I'll just use the back.\"","\n",{"->":"Continue"},{"#f":1}],"Continue":[["^Finally, Destin arrived at the riverbank.","\n","^The flowers were singing and shaking their heads. Woodland animals hugged each other as all best friends did. The grass was so green Destin forgot other colors existed. Baby ducks cuddled near their mothers as they swam away. The river curved jumped and back flipped all over the place. This riverbank came straight from a six-year-old drawing. Everything was so happy and full of life.","\n","^It made Destin sick. He almost died from all the cuteness. Or died again in this case. Destin paused and searched the surrounding area. He didn’t realize how much progress he made.","\n","^“Yes! I’m already halfway there,” said Destin. “And I did it all by myself, like a big boy.”","\n","^Destin felt a strange pride in him. All his afterlife. He had servants taking care of him. It didn’t leave him much room for growth. Is this what commoners felt like? This pride of doing things by one’s own actions. What if there’s more to life than being Lord Viscount?","\n","^“Nonsense. Being Lord Viscount is the best thing ever,” Destin said, dismissing such thoughts. “It will be even better once I reach the Arm and Leg Tavern.","\n","ev","str","^Go Upstream","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Chop Down a Tree","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Go Downstream","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n",{"->":"Upstream"},{"#f":5}],"c-1":["\n",{"->":"ChopDownTree"},{"#f":5}],"c-2":["\n",{"->":"DownStream"},{"#f":5}]}],{"#f":1}],"Upstream":["^more info on coming from upstream to here.","\n","^Here he was, the Arm and Leg Tavern.","\n","^The Arm and Leg tavern was a carpool of criminal activity. A black market for thugs, fiends, and villains. The building’s outer structure comprises stones and wooden pillars. Broken windows and a few graves all over. Nothing unusual for the great Lord Destin. From the outside, the tavern looked dark and dirty. The inside wasn’t much better.","\n","^Squared wooden beams support the upper floor on the verge of snapping. The walls were covered in death threats and explicit messages. Some of them had to be censored for reader discretion. The few people inside were murderers. Destin was welcomed with watching eyes and the smell of alcohol.","\n","^He approached the bartender who just coughed into a dirty napkin.","\n","^Everything about this place was deprived of any virtue. It almost made Destin cry out of joy. Once he had his new body, he could cry and smell all he wants.","\n","^“Welcome to the Arm and Leg Tavern,” said the barkeep. A tough macho man with the name “Mimi’ written on his nametag. “We sell body parts here. Not with the drinks, of course.”","\n","^“I know that” said Destin. It was written on their front sign. “I would like to buy a full body please.”","\n","^The bartender raised an eyebrow.","\n","^“Looks like we have a big spender here,” said Mimi, the bartender. “Show me the money first.","\n","^Destin kept his coin pouch on the countertop. The pouch was so heavy it broke the table.","\n","^“This should be more than enough,” Destin said with a skeletal smile. “Bring me your best parts. “","\n","^“Coming right up, sir,” said the barkeep. “Pay for the broken table.”","\n","^“Don’t worry, I have that covered.”","\n","^And so, Mimi gave the skeleton a new body. Destin looked like a God in human form. All will fall before his gorgeous human looks. Power coursed through his new body.Now he had skin, flesh, and bones all in one body. It’s like wearing three winter coats on a summer morning. Destin walked out of the Arm and Leg Tavern as a new man. Literally. Destin did so much without a single servant’s help. This journey thought him a powerful lesson.","\n","^“I can’t believe I’m saying this. But this journey has taught me a valuable lesson,” said Destin, checking his new body out. “I’m going to do things on my own from now on. That shouldn’t be too hard in this new body.”","\n","^And so, Lord Viscount Destin Esquire, The Dapper Cadaver, lived happily ever after.","\n","^THE END (but like in a good way).","\n","end",{"#f":1}],"ChopDownTree":["^Destin noticed a tree next to the riverbank. The one that wasn’t singing about sunshine and rainbows. There was also an ax stuck on the bark. A forester must have left it there after being attacked by rabbits (lucky guess). Perfect. He could cut down the tree and make a bridge. Then, he could cross the river.","\n","^“I came up with yet another brilliant plan,” said Destin. “There’s no possible way anything bad can happen.”","\n","^Oh, sweet naïve skeleton.","\n","^With a smile on his face, Destin approached the tree. He grabbed the axe and hacked right through it. The old Destin would never do grunt work. That’s what the servants are for. But desperate times called for desperate measures. Destin had to do things by himself, like a normal person. He had no experience with tree cutting. Not like that mattered. No flesh, no splinters. Destin chopped and hacked the tree until it fell.","\n","^“Timber!” shouted Destin as the tree collapsed on the riverbank. He always wanted to say that.","\n","^There’s only one problem. The tree was too short.","\n","^Destin didn’t think about it. He was too caught up in the tree chopping moment. Water exploded from the tree’s impact. Destin expected it to be a natural bridge. Instead, it floated downstream like a premature boat. Destin chased after it but fell down moments after. His skeleton legs couldn’t keep up with all this running. When Destin got up, the tree was gone. He curled up in a fetus position and moaned like a baby. What else could the skeleton do?","\n","^Looks like Destin got the short end of the tree.","\n","^The End","\n","end",{"#f":1}],"DownStream":["^The rabbits","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}